/* ViewDdrSaExport */
" errors occured." = " errors occured.";

/* ViewDdrSaExport */
" items." = " items.";

/* ViewCategorySelect */
"----- Version Information Main Text-----" = "* Update:
- We have launched a webpage called DDR FlareNote as a service to share Flare Skill Charts.
In conjunction with this, we have added a feature to upload Flare Skill target song data to FlareNote from this app. Please check \'FlareNote Uploader\' in the upper right menu.
- Fixed an issue where exporting some songs to DDR SA failed.";

/* ViewFilterSetting */
"1. Input FROM(minimum) clears." = "1. Input FROM(minimum) clears.";

/* ViewFilterSetting */
"1. Input FROM(minimum) combo." = "1. Input FROM(minimum) combo.";

/* ViewFilterSetting */
"1. Input FROM(minimum) plays." = "1. Input FROM(minimum) plays.";

/* ViewFilterSetting */
"1. Input FROM(minimum) rival clears." = "1. Input FROM(minimum) rival clears.";

/* ViewFilterSetting */
"1. Input FROM(minimum) rival combo." = "1. Input FROM(minimum) rival combo.";

/* ViewFilterSetting */
"1. Input FROM(minimum) rival plays." = "1. Input FROM(minimum) rival plays.";

/* ViewFilterSetting */
"1. Input FROM(minimum) rival score." = "1. Input FROM(minimum) rival score.";

/* ViewFilterSetting */
"1. Input FROM(minimum) score." = "1. Input FROM(minimum) score.";

/* ViewFilterSetting */
"1. Input MINUS FROM(minimum) clear count difference." = "1. Input MINUS FROM(minimum) clear count difference.";

/* ViewFilterSetting */
"1. Input MINUS FROM(minimum) max combo difference." = "1. Input MINUS FROM(minimum) max combo difference.";

/* ViewFilterSetting */
"1. Input MINUS FROM(minimum) play count difference." = "1. Input MINUS FROM(minimum) play count difference.";

/* ViewFilterSetting */
"1. Input MINUS FROM(minimum) score difference." = "1. Input MINUS FROM(minimum) score difference.";

/* ViewFilterSetting */
"1. Input PLUS FROM(minimum) clear count difference." = "1. Input PLUS FROM(minimum) clear count difference.";

/* ViewFilterSetting */
"1. Input PLUS FROM(minimum) max combo difference." = "1. Input PLUS FROM(minimum) max combo difference.";

/* ViewFilterSetting */
"1. Input PLUS FROM(minimum) play count difference." = "1. Input PLUS FROM(minimum) play count difference.";

/* ViewFilterSetting */
"1. Input PLUS FROM(minimum) score difference." = "1. Input PLUS FROM(minimum) score difference.";

/* ViewMenuRival */
"1. Input rival Name." = "1. Input rival Name.";

/* ViewFilterSetting */
"2. Input MINUS TO(maximum) clear count difference." = "2. Input MINUS TO(maximum) clear count difference.";

/* ViewFilterSetting */
"2. Input MINUS TO(maximum) max combo difference." = "2. Input MINUS TO(maximum) max combo difference.";

/* ViewFilterSetting */
"2. Input MINUS TO(maximum) play count difference." = "2. Input MINUS TO(maximum) play count difference.";

/* ViewFilterSetting */
"2. Input MINUS TO(maximum) score difference." = "2. Input MINUS TO(maximum) score difference.";

/* ViewFilterSetting */
"2. Input PLUS TO(maximum) clear count difference." = "2. Input PLUS TO(maximum) clear count difference.";

/* ViewFilterSetting */
"2. Input PLUS TO(maximum) max combo difference." = "2. Input PLUS TO(maximum) max combo difference.";

/* ViewFilterSetting */
"2. Input PLUS TO(maximum) play count difference." = "2. Input PLUS TO(maximum) play count difference.";

/* ViewFilterSetting */
"2. Input PLUS TO(maximum) score difference." = "2. Input PLUS TO(maximum) score difference.";

/* ViewManageRivals
   ViewMenuRival */
"2. Input rival DDR Code (8 digit number)." = "2. Input rival DDR Code (8 digit number).";

/* ViewFilterSetting */
"2. Input TO(maximum) clears." = "2. Input TO(maximum) clears.";

/* ViewFilterSetting */
"2. Input TO(maximum) combo." = "2. Input TO(maximum) combo.";

/* ViewFilterSetting */
"2. Input TO(maximum) plays." = "2. Input TO(maximum) plays.";

/* ViewFilterSetting */
"2. Input TO(maximum) rival clears." = "2. Input TO(maximum) rival clears.";

/* ViewFilterSetting */
"2. Input TO(maximum) rival combo." = "2. Input TO(maximum) rival combo.";

/* ViewFilterSetting */
"2. Input TO(maximum) rival plays." = "2. Input TO(maximum) rival plays.";

/* ViewFilterSetting */
"2. Input TO(maximum) rival score." = "2. Input TO(maximum) rival score.";

/* ViewFilterSetting */
"2. Input TO(maximum) score." = "2. Input TO(maximum) score.";

/* MusicSortTypeLister */
"ABC" = "ABC";

/* ViewMenuMusicSelected
   ViewScoreList */
"Add to MyList" = "Add to MyList";

/* ViewDdrSaAuthenticate */
"Authenticating..." = "Authenticating...";

/* ViewDdrSaAuthenticate */
"Authentication failed." = "Authentication failed.";

/* ViewDdrSaAuthenticate */
"Authentication failure" = "Authentication failure";

/* ViewDdrSaExport */
"Authentication failure. Retry after reauthenticate." = "Authentication failure. Retry after reauthenticate.";

/* ViewDdrSa */
"Authentication ID: " = "Authentication ID: ";

/* ViewDdrSaAuthenticate */
"Authentication succeed." = "Authentication succeed.";

/* MusicSortTypeLister */
"Average BPM" = "Average BPM";

/* ViewFromGatePlayerStatus
   ViewFromGateRecent
   ViewFromGateRivalList */
"Canceled in 3 time errors." = "Canceled in 3 time errors.";

/* ViewFromGate
   ViewFromGateList
   ViewFromGatePlayerStatus
   ViewFromGateRecent
   ViewFromGateRivalList */
"Canceled." = "Canceled.";

/* ViewFromGate
   ViewFromGateList
   ViewFromGatePlayerStatus
   ViewFromGateRecent
   ViewFromGateRivalList */
"Canceling..." = "Canceling...";

/* ViewMusicListUpdate */
"Checking for update..." = "Checking for update...";

/* ViewDdrSaAuthenticate */
"Checking..." = "Checking...";

/* MusicSortTypeLister
   ViewDirectEdit */
"Clear Count" = "Clear Count";

/* ViewFilterSetting */
"Clear Count Difference (Minus)" = "Clear Count Difference (Minus)";

/* ViewFilterSetting */
"Clear Count Difference (Plus)" = "Clear Count Difference (Plus)";

/* ViewFilterSetting */
"Clear Count Range" = "Clear Count Range";

/* MusicSortTypeLister */
"Combo Count" = "Combo Count";

/* ViewDdrSaExport */
"Data load failure." = "Data load failure.";

/* ViewManageRivals
   ViewMenuRival */
"DDR Code requires 8 digit number." = "DDR Code requires 8 digit number.";

/* ViewCategorySelect
   ViewMenuSystem
   ViewScoreList
   ViewSubCategorySelect */
"DDR SA" = "DDR SA";

/* ViewCategorySelect */
"DDR Score Manager needs to access internet to download music list file on 1st launch. Press OK to retry." = "DDR Score Manager needs to access internet to download music list file on 1st launch. Press OK to retry.";

/* MusicSortTypeLister */
"Difficulty" = "Difficulty";

/* ViewMenuMusicSelected
   ViewScoreList */
"Direct Edit" = "Direct Edit";

/* ViewMenuMusicSelected
   ViewScoreList */
"Display all pattern" = "Display all pattern";

/* ViewManageRivals */
"Display my scores only" = "Display my scores only";

/* ViewDdrSaAuthenticate
   ViewDdrSaExport
   ViewFromGate
   ViewFromGateList
   ViewFromGatePlayerStatus
   ViewFromGateRecent
   ViewFromGateRivalList
   ViewMusicListUpdate */
"Done." = "Done.";

/* ViewMusicListUpdate */
"Downloading Music ID Information File..." = "Downloading Music ID Information File...";

/* ViewMusicListUpdate */
"Downloading Music Information File..." = "Downloading Music Information File...";

/* ViewMusicListUpdate */
"Downloading Shock Arrow Information File..." = "Downloading Shock Arrow Information File...";

/* ViewManageRivals
   ViewMenuRival */
"Edit code & name" = "Edit code & name";

/* ViewFilterSetting
   ViewManageRivals
   ViewMenuRival
   ViewSortSetting */
"Error" = "Error";

/* ViewFromGate */
"ERROR!!! : No valid WEB music ID found." = "ERROR!!! : No valid WEB music ID found.";

/* ViewFromGate
   ViewFromGateList
   ViewFromGatePlayerStatus
   ViewFromGateRecent
   ViewFromGateRivalList */
"ERROR!!! : Retrying..." = "ERROR!!! : Retrying...";

/* ViewFilterSetting */
"Exclude" = "Exclude";

/* ViewDdrSaExport */
"Export failed." = "Export failed.";

/* ViewMenuSystem */
"Export scores to DDR Skill Attack." = "Export scores to DDR Skill Attack.";

/* ViewDdrSaExport */
"Exported " = "Exported ";

/* ViewDdrSaExport */
"Exporting scoredata started." = "Exporting scoredata started.";

/* ViewFilterSetting */
"Filter Name" = "Filter Name";

/* ViewFilterSetting */
"Filter Name is empty." = "Filter Name is empty.";

/* ViewFromGate
   ViewFromGateList
   ViewFromGatePlayerStatus
   ViewFromGateRecent
   ViewFromGateRivalList
   ViewMusicListUpdate */
"Finished." = "Finished.";

/* MusicSortTypeLister */
"Flare Rank" = "Flare Rank";

/* MusicSortTypeLister */
"Flare Skill" = "Flare Skill";

/* ViewMenuMusicSelected
   ViewScoreList */
"from GATE" = "from GATE";

/* ViewManageRivals
   ViewMenuRival
   ViewMenuSystem
   ViewScoreList */
"from GATE (detail)" = "from GATE (detail)";

/* ViewCategorySelect
   ViewManageRivals
   ViewMenuRival
   ViewMenuSystem
   ViewScoreList
   ViewSubCategorySelect */
"from GATE (simple)" = "from GATE (standard)";

/* MusicSortTypeLister */
"Full Combo Type" = "Full Combo Type";

/* ViewManageRivals
   ViewMenuRival
   ViewMenuSystem */
"Get all scores with no detail data." = "Get all scores and fullcombo states.";

/* ViewManageRivals
   ViewMenuRival
   ViewMenuSystem */
"Get listed item scores from GATE" = "Get listed item scores from GATE";

/* MusicSortTypeLister */
"ID" = "ID";

/* ViewFilterSetting */
"Include" = "Include";

/* ViewDirectEdit */
"Input clear count and press OK." = "Input clear count and press OK.";

/* ViewFilterSetting */
"Input filter name and press OK." = "Input filter name and press OK.";

/* ViewDirectEdit */
"Input max combo and press OK." = "Input max combo and press OK.";

/* ViewMyList */
"Input mylist name and press OK." = "Input mylist name and press OK.";

/* ViewDirectEdit */
"Input play count and press OK." = "Input play count and press OK.";

/* ViewDirectEdit */
"Input rival clear count and press OK." = "Input rival clear count and press OK.";

/* ViewDirectEdit */
"Input rival max combo and press OK." = "Input rival max combo and press OK.";

/* ViewDirectEdit */
"Input rival play count and press OK." = "Input rival play count and press OK.";

/* ViewDirectEdit */
"Input rival score and press OK." = "Input rival score and press OK.";

/* ViewDirectEdit */
"Input score and press OK." = "Input score and press OK.";

/* ViewSortSetting */
"Input sort name and press OK." = "Input sort name and press OK.";

/* ViewPreferences */
"Input threshold score and press OK." = "Input threshold score and press OK.";

/* ViewManageRivals */
"Load active rival's all scores from GATE with no detail data." = "Load active rival's all scores and fullcombo states from GATE.";

/* ViewManageRivals */
"Load active rival's scores listed from GATE with detail data." = "Load active rival's scores listed from GATE with detail data.";

/* ViewCategorySelect
   ViewScoreList */
"Load all scores from GATE with no detail data." = "Load all scores and fullcombo states from GATE. (Rival scores can load from rival list.)";

/* ViewScoreList */
"Load scores listed from GATE with detail data." = "Load scores listed from GATE with detail data. (Rival scores can load from rival list.)";

/* ViewFromGatePlayerStatus */
"Loading player status page." = "Loading player status page.";

/* ViewFromGatePlayerStatus */
"Loading player status started." = "Loading player status started.";

/* ViewFromGateRecent */
"Loading recent page." = "Loading recent page.";

/* ViewFromGateRecent */
"Loading recent started." = "Loading recent started.";

/* ViewFromGateRivalList */
"Loading rival list page." = "Loading rival list page.";

/* ViewFromGateRivalList */
"Loading rival list started." = "Loading rival list started.";

/* ViewFromGate
   ViewFromGateList */
"Loading scores started." = "Loading scores started.";

/* ViewFromGate
   ViewFromGateList
   ViewFromGatePlayerStatus
   ViewFromGateRecent
   ViewFromGateRivalList */
"Logged in." = "Logged in.";

/* ViewCategorySelect
   ViewManageRivals
   ViewMenuSystem
   ViewScoreList
   ViewSubCategorySelect */
"Manage Rivals" = "Manage Rivals";

/* ViewPreferences */
"Manual Gate Login" = "Manual Gate Login";

/* ViewPreferences */
"Manual login to GATE server. This operation is not automaticaly close. When you detect logged in, close the login window manualy." = "Manual login to GATE server. This operation is not automaticaly close. When you detect logged in, close the login window manualy.";

/* MusicSortTypeLister */
"Max BPM" = "Max BPM";

/* ViewFilterSetting */
"Max clear count required over than MIN number." = "Max clear count required over than MIN number.";

/* ViewDirectEdit */
"Max Combo" = "Max Combo";

/* ViewFilterSetting */
"Max combo count required over than MIN number." = "Max combo count required over than MIN number.";

/* ViewFilterSetting */
"Max Combo Difference (Minus)" = "Max Combo Difference (Minus)";

/* ViewFilterSetting */
"Max Combo Difference (Plus)" = "Max Combo Difference (Plus)";

/* ViewFilterSetting */
"Max Combo Range" = "Max Combo Range";

/* ViewFilterSetting */
"Max play count required over than MIN number." = "Max play count required over than MIN number.";

/* ViewFilterSetting */
"Max score required FROM to 1000000 number." = "Max score required FROM to 1000000 number.";

/* ViewFilterSetting */
"Max score required over than MIN number." = "Max score required over than MIN number.";

/* ViewMusicListUpdate */
"Media error occured." = "Media error occured.";

/* MusicSortTypeLister */
"Min BPM" = "Min BPM";

/* ViewFilterSetting */
"Min clear count required over than 0 number." = "Min clear count required over than 0 number.";

/* ViewFilterSetting */
"Min combo count required over than 0 number." = "Min combo count required over than 0 number.";

/* ViewFilterSetting */
"Min play count required over than 0 number." = "Min play count required over than 0 number.";

/* ViewFilterSetting */
"Min score required 0 to 1000000 number." = "Min score required 0 to 1000000 number.";

/* ViewFromGate */
"Music ID is different on GATE server." = "Music ID is different on GATE server.";

/* ViewFromGate */
"Data could not be retrieved." = "Data could not be retrieved due to being locked, not played, deleted, or other reasons.";

/* ViewMusicListUpdate */
"Music list download failed." = "Music list download failed.";

/* ViewMyList */
"My List Name" = "My List Name";

/* ViewFromGate
   ViewFromGateList */
"My scores." = "My scores.";

/* ViewDdrSaAuthenticate
   ViewDdrSaExport
   ViewMusicListUpdate */
"Network error occured." = "Network error occured.";

/* ViewCategorySelect */
"Network error!" = "Network error!";

/* ViewMusicListUpdate */
"No Updates are found." = "No Updates are found.";

/* MusicSortTypeLister */
"None" = "None";

/* ViewFilterSetting */
"Only" = "Only";

/* ViewCategorySelect */
"Open Manual" = "Open Manual";

/* ViewCategorySelect */
"Open manual page with Safari." = "Open manual page with Safari.";

/* ViewFromGate
   ViewFromGateList
   ViewFromGatePlayerStatus
   ViewFromGateRecent
   ViewFromGateRivalList */
"Opening login form..." = "Opening login form...";

/* MusicSortTypeLister */
"Pattern" = "Pattern";

/* ViewFromGate
   ViewFromGateList */
"Paused in 3 time errors." = "Paused in 3 time errors.";

/* ViewFromGate
   ViewFromGateList */
"Paused." = "Paused.";

/* MusicSortTypeLister
   ViewDirectEdit */
"Play Count" = "Play Count";

/* ViewFilterSetting */
"Play Count Difference (Minus)" = "Play Count Difference (Minus)";

/* ViewFilterSetting */
"Play Count Difference (Plus)" = "Play Count Difference (Plus)";

/* ViewFilterSetting */
"Play Count Range" = "Play Count Range";

/* ViewCategorySelect
   ViewScoreList
   ViewSubCategorySelect */
"Player Status" = "Player Status";

/* ViewFromGate */
"Please report to us." = "Please report to us.";

/* ViewCategorySelect
   ViewMenuSystem
   ViewScoreList
   ViewSubCategorySelect */
"Preferences" = "Preferences";

/* ViewDdrSa */
"Press \"Authenticate\" button \r\n to authenticate DDR SA." = "Press \"Authenticate\" button \r\n to authenticate DDR SA.";

/* ViewMenuSystem
   ViewScoreList */
"Random Pickup" = "Random Pickup";

/* MusicSortTypeLister */
"Rank" = "Rank";

/* MusicSortTypeLister */
"Recent" = "Recent";

/* ViewMenuMusicSelected
   ViewScoreList */
"Remove From This MyList" = "Remove From This MyList";

/* ViewScoreList */
"Memo" = "Memo";

/* ViewScoreList */
"Memo saved." = "Memo saved.";

/* ViewScoreList */
"Please enter your memo." = "Please enter your memo.";

/* ViewFromGate
   ViewFromGateList */
"Resumed." = "Resumed.";

/* MusicSortTypeLister */
"Rival Clear Count" = "Rival Clear Count";

/* ViewFilterSetting */
"Rival Clear Count Range" = "Rival Clear Count Range";

/* MusicSortTypeLister */
"Rival Combo Count" = "Rival Combo Count";

/* ViewManageRivals
   ViewMenuRival */
"Rival DDR Code" = "Rival DDR Code";

/* MusicSortTypeLister */
"Rival Full Combo Type" = "Rival Full Combo Type";

/* ViewFilterSetting */
"Rival Max Combo Range" = "Rival Max Combo Range";

/* ViewMenuRival */
"Rival Name" = "Rival Name";

/* ViewManageRivals
   ViewMenuRival */
"Rival Name is empty." = "Rival Name is empty.";

/* MusicSortTypeLister */
"Rival Play Count" = "Rival Play Count";

/* ViewFilterSetting */
"Rival Play Count Range" = "Rival Play Count Range";

/* MusicSortTypeLister */
"Rival Rank" = "Rival Rank";

/* MusicSortTypeLister */
"Rival Score" = "Rival Score";

/* MusicSortTypeLister */
"Rival Score Difference" = "Rival Score Difference";

/* MusicSortTypeLister */
"Rival Score DifferenceAbs" = "Rival Score DifferenceAbs";

/* ViewFilterSetting */
"Rival Score Range" = "Rival Score Range";

/* ViewPreferences */
"Save as PFC threshold" = "Save as PFC threshold";

/* MusicSortTypeLister
   ViewDirectEdit */
"Score" = "Score";

/* ViewFilterSetting */
"Score Difference (Minus)" = "Score Difference (Minus)";

/* ViewFilterSetting */
"Score Difference (Plus)" = "Score Difference (Plus)";

/* ViewFilterSetting */
"Score Range" = "Score Range";

/* ViewMyList */
"Select My List" = "Select My List";

/* MusicSortTypeLister */
"Series Title" = "Series Title";

/* ViewFromGate */
"Skipped." = "Skipped.";

/* ViewSortSetting */
"Sort Name" = "Sort Name";

/* ViewSortSetting */
"Sort Name is empty." = "Sort Name is empty.";

/* MusicSortTypeLister */
"SP/DP" = "SP/DP";

/* ViewMenuSystem
   ViewScoreList */
"Statistics" = "Statistics";

/* ViewFromGate
   ViewFromGateList */
"Target: " = "Target: ";

/* ViewFromGate
 ViewFromGateList */
"Version: " = "Version: ";

/* ViewMusicListUpdate */
"Update file is now editing." = "Update file is now editing.";

/* ViewCategorySelect */
"Version Info" = "Version Info";

/* ViewDdrSaAuthenticate
   ViewDdrSaExport
   ViewMusicListUpdate */
"Wait a while..." = "Wait a while...";

/* ViewManageRivals */
"Scores from old DDR SM" = "Scores from old DDR SM";

/* ViewManageRivals */
"Invalid DDR Code." = "Invalid DDR Code";

/* ViewManageRivals */
"Read from clipboard" = "Read from clipboard";

/* ViewManageRivals */
"You can use scoredata from DDR Score Manager 2013 (old DDR SM version). On old score manager,\"Menu\"->\"Preferences\"->\"Import/Export\"->\"Copy score database\". And import on this menu." = "You can use scoredata from DDR Score Manager 2013 (old DDR SM version). On old score manager,\"Menu\"->\"Preferences\"->\"Import/Export\"->\"Copy score database\". And import on this menu.";

/* ViewManageRivals */
"Succeed" = "Succeed";

/* ViewManageRivals */
"Import completed." = "Import completed.";

/* ViewManageRivals */
"Error" = "Error";

/* ViewManageRivals */
"No scores detected from clipboard." = "No scores detected from clipboard.";

/* ViewScoreList */
"Copy to clipboard" = "Copy to clipboard";

/* ViewScoreList */
"Select format" = "Select format";

/* ViewScoreList */
"Scoredata has been copied to clipboard." = "Scoredata has been copied to clipboard.";

/* ScoreList */
"Edit copy formats..." = "Edit copy formats...";

/* ScoreList */
"Rival Score" = "Rival Score";

/* FlareNoteUploader */
"FlareNoteUploader" = "FlareNote Uploader";

/* FlareNoteUploader */
"FlareNote_Input_user_name" = "Input user name";

/* FlareNoteUploader */
"FlareNote_Register User" = "Regisger User";

/* FlareNoteUploader */
"FlareNote_Send Song Data" = "Send Song Data";

/* FlareNoteUploader */
"FlareNote_Your Page" = "Your Page";

/* FlareNoteUploader */
"FlareNote_Delete User" = "Delete User / Change Username";

/* FlareNoteUploader */
"FlareNote_How to use" = "How to Use?";

/* FlareNoteUploader */
"FlareNote_How to use detail" = "1. Register user name
2. Send song data
3. Check your page on FlareNote
* This is a beta feature.If you encounter any issues, please contact us on X (@sig_re).";

/* FlareNoteUploader */
"FlareNote_Please enter your username" = "Please enter your username.";

/* FlareNoteUploader */
"FlareNote_Recieving data is failed" = "Recieving data is failed.";

/* FlareNoteUploader */
"FlareNote_User created successfully" = "User %@ has been successfully created.";

/* FlareNoteUploader */
"FlareNote_error detail" = "Error: %@
Detail: %@";

/* FlareNoteUploader */
"FlareNote_Please register user" = "Please register a user and then send data.";

/* FlareNoteUploader */
"FlareNote_Sent data successfully" = "The data has been sent successfully.";

/* FlareNoteUploader */
"FlareNote_User deleted" = "User %@ deleted.";
/* FlareNoteUploader */
/* FlareNoteUploader */
